       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TESTC04.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WK-PARM.
           05  WK-FUNC         PIC X(2) VALUE 'XX'.
           05  WK-GENGO        PIC X(1) VALUE SPACE.
           05  WK-DATE-IN      PIC X(8) VALUE '20240101'.
           05  WK-DATE-OUT     PIC X(8) VALUE SPACES.
           05  WK-SERIAL       PIC S9(7) COMP-3 VALUE ZERO.
           05  WK-RC           PIC 9(2) VALUE ZERO.
       PROCEDURE DIVISION.
           DISPLAY 'TESTC04 BEFORE CALL'.
           CALL 'RUTLDTC' USING WK-PARM.
           DISPLAY 'TESTC04 AFTER CALL (SHOULD NEVER APPEAR)'.
           STOP RUN.
