      *----------------------------------------------------------------
      * RCDATWK 日付共通サブ RUTLDTC インタフェース
      *----------------------------------------------------------------
       01  DTC-PARM.
           05  DTC-FUNC            PIC X(2).
           05  DTC-GENGO           PIC X(1).
           05  DTC-DATE-IN         PIC X(8).
           05  DTC-DATE-OUT        PIC X(8).
           05  DTC-SERIAL          PIC S9(7) COMP-3.
           05  DTC-RC              PIC 9(2).
